inventory.org
#+title: Homelab inventory
#+author: John Lambert
#+startup: overview

* Purpose
