inventory.tex

\section{Purpose}
\label{sec:org13ea528}
\subsection{Autobiographical bullshit you can skip if you want}
\label{sec:org6dcb9cd}

\begin{quote}
\emph{Indeed, it is quite \href{https://en.wikipedia.org/wiki/The\_Life\_and\_Opinions\_of\_Tristram\_Shandy,\_Gentleman}{Sternian.}} - My ChatGPT
\end{quote}

My very first computer was an Acer Aspire 510LK that ran the sensation of the day: Windows 95.

I wish I could say that I was already on my way to being a world beating programmer, but since I was 5 years old I can't really claim full ownership of it. Its day job was as a workstation in my Mother and Grandfather's law office. But immediately afterschool it became my window into the new world of computers.

The biggest issue was that we hadn't yet been connected to the internet. I was "offline first" before it was cool. I mostly used computers for my favorite games:
\begin{itemize}
\item Tyrian
\item Age of Empires
\item Some game about a fly working at an airport (Spirit Airlines would have hired him as a baggage handler.)
\item The Acer version of Encarta
\end{itemize}

The last supplemented my World Book habit. I would read my grandfather's World Books instead of socializing with him. That is a decision I feel decidely mixed about since my grandfather was an amazing man with great stories (Including several about working for Admiral Nimitz during World War II.) But as I was making my way alphabetically through the world up until my birth it took me a while to get to 'Unix.'

When I did finally get access to the internet at my mother's work. (She left private practice to be one of Kentucky's first Family Court judges.) I used the Commonwealth's fine connection to look at a website called the "HappyHacker" website. This was a really fun artifact of the old Internet that was basically just the collected computational whimsy of a lady named Carolyn Meniel. It was more inspiration than information. But I did learn about these things called "shell accounts" and how to edit the "It is now safe to turn off your computer" dialog on Windows 95 via Paint. 

Another honorable mention is a family friend named Jerry. Jerry was an engineer at IBM in Lexington KY. (It later became Lexmark.) He ran a local BBS. I wish I could say I have fond memories of this but mostly I just got to hear how cool the internet was going to be while I looked for unattended America Online disks. I never got to use that BBS, Jerry. But it sounded awesome.

Anyway, much of this early exploration was encouraged by my first cousin's husband Terry. Terry passed away far too early, but I would pester him with questions like "What really is a file? Does the computer get heavier?" and he would use his enthusiasm to come up with an answer. They honestly were probably pretty fair answers as Terry's main passion was chemistry and physics. I also had a third grade teacher named Mr. Roark who was friends with Terry and I would occaisonally see them studying for some certification's together. I remember one conversation I overheard where they discussed the impending "Microsoft NT" and its benefits. It was an analog introduction to the operating system flamewars fate had in store for me.

I had, by this time, upgraded to Windows 98. My mother would use it to keep track of our geneology (spoiler alert: white) and would manually go back and forth between the library and home with 3x5 index cards with our pedigree meticulously annotated. I would use the PC for Age of Empires (of course) and also various shenanigans like typing out (.)(.) to see what would happen (it was great.)

Other than that, I was a rather unexceptional user. Until the November 25th, 2003 edition of PC Magazine. See, just before Terry died he signed up my family for PC Magazine. The whole family would occasionally pile into the car to get our magazines at the Post Office (my town didn't have convenient mail delivery in the early 2000s.) I honestly have no idea if PCMag even exists, but it did some great articles on a terrible platform.

The article was titled "If You Don't Do Windows\ldots{}" and was a straightforward review of several Linux options. I tracked down a \href{https://books.google.com/books?id=wwM2AxyTBIUC\&pg=PA144\&dq=Xandros\&hl=en\&sa=X\&ved=2ahUKEwjxkrqa7uiUAxU85ckDHePHN9sQ6AF6BAgMEAM\#v=onepage\&q=Xandros\&f=false}{copy} and was surprised to find that it mentioned some software that I still use to this day: GIMP and Blender. In fact I used both to design my house, Wits' End Farm. So to say that this article was foundational is actually not an exaggeration.

The author definitely didn't intend for it to be a manifesto. It doesn't mention the operating system was written by a teenager in Finland (it was.) That it was part of a larger movement that focused on the rights of users in an increasingly digital world (ditto) or even that it had a kickass Penguin mascot (definitely.)

Relevant to this homelab configuration (remember that?) is the following sentence:

\begin{quote}
\emph{The flexibility of Linux has been coupled with the complexity and a range of options often confusing to those approaching the OS for the first time. Multiple window managers, shells, and a bewildering array of application have made the learning curve hard for the point-and-click crowd.}
\end{quote}

(Little did the author know that his words would eventually become enshrined in the weirdest configuration file ever.)

Another throwaway line that got me:

\begin{quote}
\emph{Linux is open-source, so the software is available for free.}
\end{quote}

Holy smokes! It was unbelievable. The idea that an operating system (which was, at the time, an expensive piece of software that came in a box) would be made freely available was laughable. My Dad had been a big fan of the financial press during the dot-com bubble. I knew the real money was to be made in operating systems since there was no marginal cost. (I also raided my father's old textbooks in Economics.) 

So I became transfixed on this Linux thing.

Just one problem for a budding computer scientist: I didn't have a computer. Computers at the time belonged to whole families. They were not personal devices. I was also 11 years old so I didn't have any real knowledge about file partition tables or anything. (I believe at this point in time I knew menstruation was a thing, but thought it was blue because of the dye used in tampon commercials. I was already jaded, but not shrewd.) 

My solution was as follows: I got a distribution (muLinux) that could be installed on a Windows 98 FAT32 partition. This would be my end. I would become the Uber Hacker of the 40456 Zip code. I had seen the highly edited version of 'Swordfish' on TNT. The world was soon to be my oyster.

A precarious series of floppy drives at hand, I took them back and forth to school every day until I had enough to install Linux. (This actually was far fewer than you would think even in 2003.) I would like to think my teachers thought I was somehow defeating the NetWare proxy server in order to look at pornography like a normal kid. But nope, it was Linux. 

I loaded them into my computer and hit a snag. (I wish I could tell you what it was, but I actually was Dunning-Kreugering myself to the point where I have no real way to describe what happened in any meaninful way.) No worries though. I had a text file with the install instructions. Let's just boot back into Windows 98, open up Notepad and\ldots{}


Nothing.

I borked the family PC's partition table the first time I so much as saw a Tux on a CRT.

I ran with a guilty conscience to my mother. Remember those pedigrees so painstakingly taken? The ones she went to Salt Lake City and pretended to want to be a Mormon in order to get? Gone. Poof. Linux had taken a chainsaw to my family tree.

She told me (halfway joking, halfway not) that since I had deleted the records of my ancestry I was now a bastard. Either way the files were gone. (So far as any of us could tell.) 

Fast forward from age 11 to 35 and I am still a bastard (self made, not natural born.) But in the intervening years I have become the Uber Hacker of the 40456 ZIP code I always wanted to be.

I have a homelab. I use NixOS. I use vim. In Emacs. I put vim inside emacs damnit. 

In fact, this is how I configure my homelab. In prose. Using this very document with Spirit Airlines jokes and questionably sourced anecdotes. 

Don't ask me how I did it. I just did it. It was hard.

Actually, just kidding. You can ask me how to do it. Please do. \href{https://en.wikipedia.org/wiki/Please\_clap}{please clap.} 
