exports/inventory.html
<div id="outline-container-org158264a" class="outline-3">
<h3 id="org158264a"><span class="section-number-3">1.2.</span> And you may ask yourself, well&#x2026; 'How did I get here?'</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Why did I do this? Not even sure I know anymore. But now I have a single text document sprawled over my digital life that describes:
</p>
<ul class="org-ul">
<li>machines</li>
<li>users / homes</li>
<li>reusable roles abstracted into modular forms</li>
<li>special facts that should probably be data rather than hand-written Nix</li>
<li>personal autobiographical details that no one cares about.</li>
</ul>

<p>
Regular homelabs are a collection of procedural detritus. They describe nothing unless the homelabber is particularly fastidious and documents how to use the system. The better ones are a series of self replicating shell scripts. (NixOS being the natural culmination of the following.) They describe what the systems are meant to be and do it (or not.)
</p>

<p>
Org-mode and the Nix language allow us to not only describe the "what" but also the "who", "when", "where", "why" and "how." I think that's neat. 
</p>

<p>
Eventually this may grow into a literate source that tangles into a TOML
inventory file and gets merged with Nix logic. For now it is just a sketchbook
and index.
</p>
</div>
</div>
</div>
<div id="outline-container-org9215441" class="outline-2">
<h2 id="org9215441"><span class="section-number-2">2.</span> Basics of Literate Programming with Org</h2>
<div class="outline-text-2" id="text-2">
<p>
Human beings have been telling stories since (best we can tell) sometime after the development of language and sometime before the development of smores. 
</p>

<p>
Human beings have been programming in a comparatively short time frame. In fact, some say recognizable programming began sometime after the development of relays and before the downfall of short sleeved white dress shirts.
</p>

<p>
So it would be reasonable to assume you are a more natural story teller than a programmer.
</p>

<p>
Imagine writing code with the tone of a campfire Homer. Spinning tales in your preferred human language that could spin up vast arrays of computing power in a way that could be reasoned about. You still write code, but in this case it exists alongside its founding documents, specifications, errata and other lore that gives it its raison d'etre. That way you can see the whole problem in its entirety in one place using the same cognitive architecture you have been developing since you were an infant. 
</p>

<p>
This is an old idea, but it has recently become infinitely more useful with the advent of LLMs.  
</p>

<p>
Enter literate programming.
</p>

<p>
And&#x2026; <b>plot twist</b> <i>You</i> are in a literate program! You may be viewing it on the web, but the file itself is still computer code that can execute, well&#x2026; anything a computer can execute.
</p>
</div>
