inventory.tex
\subsection{And you may ask yourself, well\ldots{} 'How did I get here?'}
\label{sec:orgf6592b5}
Why did I do this? Not even sure I know anymore. But now I have a single text document sprawled over my digital life that describes:
\begin{itemize}
\item machines
\item users / homes
\item reusable roles abstracted into modular forms
\item special facts that should probably be data rather than hand-written Nix
\item personal autobiographical details that no one cares about.
\end{itemize}

Regular homelabs are a collection of procedural detritus. They describe nothing unless the homelabber is particularly fastidious and documents how to use the system. The better ones are a series of self replicating shell scripts. (NixOS being the natural culmination of the following.) They describe what the systems are meant to be and do it (or not.)

Org-mode and the Nix language allow us to not only describe the "what" but also the "who", "when", "where", "why" and "how." I think that's neat. 

Eventually this may grow into a literate source that tangles into a TOML
inventory file and gets merged with Nix logic. For now it is just a sketchbook
and index.
\section{Basics of Literate Programming with Org}
\label{sec:org2ecf68d}
Human beings have been telling stories since (best we can tell) sometime after the development of language and sometime before the development of smores. 

Human beings have been programming in a comparatively short time frame. In fact, some say recognizable programming began sometime after the development of relays and before the downfall of short sleeved white dress shirts.

So it would be reasonable to assume you are a more natural story teller than a programmer.

Imagine writing code with the tone of a campfire Homer. Spinning tales in your preferred human language that could spin up vast arrays of computing power in a way that could be reasoned about. You still write code, but in this case it exists alongside its founding documents, specifications, errata and other lore that gives it its raison d'etre. That way you can see the whole problem in its entirety in one place using the same cognitive architecture you have been developing since you were an infant. 

This is an old idea, but it has recently become infinitely more useful with the advent of LLMs.  

Enter literate programming.

And\ldots{} \textbf{plot twist} \emph{You} are in a literate program! You may be viewing it on the web, but the file itself is still computer code that can execute, well\ldots{} anything a computer can execute.
