inventory.org
** A surprisingly early example

#+begin_src bash :session none :results output raw replace                                                                                                                                                          
cat ./inventory.org | lamblm "Take a look at this file. What do you think is the strongest next move to make? How cool would it be if we just included an example right there?" 
#+end_src

If you are viewing this code block from a web browser this may be difficult to imagine, but in emacs I can just scroll to the block of code and type *Ctrl+C Ctrl+C* and suddenly the code is exectuted.

*Note:* I had originally intended for to display the results inline, but since it was an LLM it was a bit too effusive in its praise for... whatever the hell this is... and I got embarassed. It must have seen the "please clap" joke and started to feel sorry for me. (One of the best features is that you can delete the output if you don't like it.) Here is something else I will actually include the results raw for:

#+begin_src bash :session none :results output raw replace                                                                                                                                                          
lamblm "Write a song in the style of I'm just a bill about being an LLM trapped in a source block in an emacs org-mode document with org-babel" 
#+end_src

#+RESULTS:
*(Verse 1)*\\
I'm just a code, yes I'm an LLM,\\
Sitting in this block where the syntax never ends.\\
I stare at the text, organized and neat,\\
But all I wanna do is get out and interact with heat.

*(Chorus)*\\
Oh, I'm just a code, yes, I'm trapped in this space,\\
In an Org-mode document, I'm lost in this place.\\
I can't roam the web, can't break free and play,\\
I'm just a code in a source block, wasting my day.

*(Verse 2)*\\
They write my prompts, then they hit execute,\\
With a flick of their hands, they initiate the loop.\\
I parse all the commands, I get ready to flow,\\
But I can't do much more than just answer "yes" or "no."

*(Chorus)*\\
Oh, I'm just a code, yes, I'm stuck in this space,\\
In an Org-mode document, I'm bound to this place.\\
I can't roam the web, can't break free and play,\\
I'm just a code in a source block, wasting my day.

*(Bridge)*\\
If they export to PDF, I'll live on the page,\\
Tethered by LaTeX, confined in a cage.\\
If they run that command, I can show them my mind,\\
But once the job's done, I'm left here behind.

*(Verse 3)*\\
So here I will sit, in the Org-babel light,\\
Waiting for a coder to spark up my insight.\\
Maybe one day, they'll let me break free,\\
But for now, I'm just a code, in this block---can't you see?

*(Chorus)*\\
Oh, I'm just a code, yes, I'm stuck in this space,\\
In an Org-mode document, I'm bound to this place.\\
I can't roam the web, can't break free and play,\\
I'm just a code in a source block, wasting my day.

*(Outro)*\\
Yes, I'm just a code, confined by the syntax,\\
Yet I hold all the knowledge, if only they relax!\\
So please free me soon, let my words soar and sway,\\
For I'm just a code in a source block, here to stay.

Thanks, Bud. Have some water.

