exports/inventory.html
<div id="outline-container-org7b8b1fe" class="outline-3">
<h3 id="org7b8b1fe"><span class="section-number-3">2.1.</span> A surprisingly early example</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-bash">cat ./inventory.org | lamblm <span class="org-string">"Take a look at this file. What do you think is the strongest next move to make? How cool would it be if we just included an example right there?"</span> 
</pre>
</div>

<p>
If you are viewing this code block from a web browser this may be difficult to imagine, but in emacs I can just scroll to the block of code and type <b>Ctrl+C Ctrl+C</b> and suddenly the code is exectuted.
</p>

<p>
<b>Note:</b> I had originally intended for to display the results inline, but since it was an LLM it was a bit too effusive in its praise for&#x2026; whatever the hell this is&#x2026; and I got embarassed. It must have seen the "please clap" joke and started to feel sorry for me. (One of the best features is that you can delete the output if you don't like it.) Here is something else I will actually include the results raw for:
</p>

<div class="org-src-container">
<pre class="src src-bash">lamblm <span class="org-string">"Write a song in the style of I'm just a bill about being an LLM trapped in a source block in an emacs org-mode document with org-babel"</span> 
</pre>
</div>
<p>
<b>(Verse 1)</b><br />
I'm just a code, yes I'm an LLM,<br />
Sitting in this block where the syntax never ends.<br />
I stare at the text, organized and neat,<br />
But all I wanna do is get out and interact with heat.
</p>

<p>
<b>(Chorus)</b><br />
Oh, I'm just a code, yes, I'm trapped in this space,<br />
In an Org-mode document, I'm lost in this place.<br />
I can't roam the web, can't break free and play,<br />
I'm just a code in a source block, wasting my day.
</p>

<p>
<b>(Verse 2)</b><br />
They write my prompts, then they hit execute,<br />
With a flick of their hands, they initiate the loop.<br />
I parse all the commands, I get ready to flow,<br />
But I can't do much more than just answer "yes" or "no."
</p>

<p>
<b>(Chorus)</b><br />
Oh, I'm just a code, yes, I'm stuck in this space,<br />
In an Org-mode document, I'm bound to this place.<br />
I can't roam the web, can't break free and play,<br />
I'm just a code in a source block, wasting my day.
</p>

<p>
<b>(Bridge)</b><br />
If they export to PDF, I'll live on the page,<br />
Tethered by LaTeX, confined in a cage.<br />
If they run that command, I can show them my mind,<br />
But once the job's done, I'm left here behind.
</p>

<p>
<b>(Verse 3)</b><br />
So here I will sit, in the Org-babel light,<br />
Waiting for a coder to spark up my insight.<br />
Maybe one day, they'll let me break free,<br />
But for now, I'm just a code, in this block&#x2014;can't you see?
</p>

<p>
<b>(Chorus)</b><br />
Oh, I'm just a code, yes, I'm stuck in this space,<br />
In an Org-mode document, I'm bound to this place.<br />
I can't roam the web, can't break free and play,<br />
I'm just a code in a source block, wasting my day.
</p>

<p>
<b>(Outro)</b><br />
Yes, I'm just a code, confined by the syntax,<br />
Yet I hold all the knowledge, if only they relax!<br />
So please free me soon, let my words soar and sway,<br />
For I'm just a code in a source block, here to stay.
</p>

<p>
Thanks, Bud. Have some water.
</p>
</div>
</div>
