exports/inventory.html
<div id="outline-container-orgcebb943" class="outline-3">
<h3 id="orgcebb943"><span class="section-number-3">2.2.</span> A surprisingly late description of <code>org</code></h3>
<div class="outline-text-3" id="text-2-2">
<p>
I have glossed over emacs and org-* so far. I made some bold choices talking about babel before org org before emacs. Deal with it. Basically emacs is a text editor, and org-mode is a format that leverages features of that text editor. (Babel is tht shit we just talked about.)
</p>

<p>
Anyway, there are other systems for literate programming. Jupyter is the most prominent example for Python. But this particular stack can execute arbitrary code. Not just via bash either. You can run a python script for sure. You can run anything you want. In fact, if you can run it on Linux you can run it from your autobiography in emacs.
</p>

<p>
The other thing is that you can export this document and publish it whereever in hypertext. All I have to do is type <b>'Ctrl+c e h'</b> and suddenly I am looking at my document rendered in HTML better than I could write by hand.  
</p>

<p>
In fact, because the text is so hyper, you can make links to other documents. Its a real <i>Choose your Own Adventure</i> type of experience. Those docuents can have their own code, link back, and so on and so forth. Just as <a href="https://en.wikipedia.org/wiki/The_Library_of_Babel">Borges</a> would have wanted. 
</p>

<p>
Think about how cool this is: imagine you are writing a blog post about the <i>Titanic</i> and the characteristics that made particular passengers survive. You could
</p>
<ul class="org-ul">
<li>write a document in <code>org</code> (the format and plugin) using <code>emacs</code> and distribute the data for the passengers</li>
<li>Then you could talk about a logistic regression,</li>
<li>describe the formula in Latex (which makes everything look fancy) and then</li>
<li>write the formula as a python script.</li>
<li>Then you could execute this <i>from the document itself</i></li>
<li>Use another system to create charts which you include</li>
<li>Type <code>Ctrl-C e h</code> to export an HTML version of your final document</li>
</ul>

<p>
And because emacs is so&#x2026; <b><i>extra</i></b> you can also render this whole thing as a PDF with perfect formatting for journal or textbook submission.
</p>

<p>
<i>Res ipsa loquitur</i>. QED.
</p>

<p>
But a literate program is also fundamentally a living document. Imagine you had a colleague who found more data about the Titanic survivors. They could easily take your document and immediately make their contribution in a way that reflected and was consistent with the original work. 
</p>

<p>
It isn't just a system for fully fleshed out documents. In fact, I haven't even talked about the best feature:
</p>
</div>
<div id="outline-container-orgb55fdff" class="outline-4">
<h4 id="orgb55fdff"><span class="section-number-4">2.2.1.</span> <span class="todo TODO">TODO</span> Talk about feature where you can record TODOs</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>

</p>

<p>
:ID:       01KT4QFCEC1KM52G9XW7VH4D8A
</p>

<p>
Org-mode has a built in todo tracking system. So you can record your progress, your goals, aspirations. You can collaborate. There are systems that take your todos and merge them with your calendar. Your todos can follow you around in all the files you specify so you can build your own personal dashboard o' productivity.
</p>

<p>
Think about how ordinary systems might require you to go to a todo app, find your highest priority item, then open the relevant program, then find the relevant data elsewhere. Then you run that, record what you got (seperately, of course.) then go back to your todo app to mark it done, etc. It is a pain in the ass.
</p>

<p>
With org, you can use the <code>(org-agenda)</code> command to get that dashboard and work on Everything In Its Right Place. It is magic. 
</p>
</div>
</div>
</div>
</div>
