inventory.tex
\subsection{A surprisingly late description of \texttt{org}}
\label{sec:orgc5c21f2}

I have glossed over emacs and org-* so far. I made some bold choices talking about babel before org org before emacs. Deal with it. Basically emacs is a text editor, and org-mode is a format that leverages features of that text editor. (Babel is tht shit we just talked about.)

Anyway, there are other systems for literate programming. Jupyter is the most prominent example for Python. But this particular stack can execute arbitrary code. Not just via bash either. You can run a python script for sure. You can run anything you want. In fact, if you can run it on Linux you can run it from your autobiography in emacs.

The other thing is that you can export this document and publish it whereever in hypertext. All I have to do is type \textbf{'Ctrl+c e h'} and suddenly I am looking at my document rendered in HTML better than I could write by hand.  

In fact, because the text is so hyper, you can make links to other documents. Its a real \emph{Choose your Own Adventure} type of experience. Those docuents can have their own code, link back, and so on and so forth. Just as \href{https://en.wikipedia.org/wiki/The\_Library\_of\_Babel}{Borges} would have wanted. 

Think about how cool this is: imagine you are writing a blog post about the \emph{Titanic} and the characteristics that made particular passengers survive. You could
\begin{itemize}
\item write a document in \texttt{org} (the format and plugin) using \texttt{emacs} and distribute the data for the passengers
\item Then you could talk about a logistic regression,
\item describe the formula in Latex (which makes everything look fancy) and then
\item write the formula as a python script.
\item Then you could execute this \emph{from the document itself}
\item Use another system to create charts which you include
\item Type \texttt{Ctrl-C e h} to export an HTML version of your final document
\end{itemize}

And because emacs is so\ldots{} \textbf{\emph{extra}} you can also render this whole thing as a PDF with perfect formatting for journal or textbook submission.

\emph{Res ipsa loquitur}. QED.

But a literate program is also fundamentally a living document. Imagine you had a colleague who found more data about the Titanic survivors. They could easily take your document and immediately make their contribution in a way that reflected and was consistent with the original work. 

It isn't just a system for fully fleshed out documents. In fact, I haven't even talked about the best feature:
\subsubsection{{\bfseries\sffamily TODO} Talk about feature where you can record TODOs}
\label{sec:orgab75af0}


:ID:       01KT4QFCEC1KM52G9XW7VH4D8A

Org-mode has a built in todo tracking system. So you can record your progress, your goals, aspirations. You can collaborate. There are systems that take your todos and merge them with your calendar. Your todos can follow you around in all the files you specify so you can build your own personal dashboard o' productivity.

Think about how ordinary systems might require you to go to a todo app, find your highest priority item, then open the relevant program, then find the relevant data elsewhere. Then you run that, record what you got (seperately, of course.) then go back to your todo app to mark it done, etc. It is a pain in the ass.

With org, you can use the \texttt{(org-agenda)} command to get that dashboard and work on Everything In Its Right Place. It is magic. 
