inventory.org
* Declarative Systems with =nix=
For those unaware NixOS allows you to describe your configuration as text directly. Think of it at first as a series of breadcrumbs. On an Ubuntu system you begin with a standard image, then type a series of commands. Each of these commands has a side effect that changes the configuration of your system. (Typically adding or removing software via apt or editing a file in /etc, for instance.) You may or may not be able to replicate your system from the first command to the last and arrive at your configuration. The system is fundamentally ephemeral.

A nix system on the other hand defines itself (insists upon itself, some say.) You or an LLM buddy describe what you want and then the nix package manager makes it happen.

It is fundamentally /declarative./

Using =nix= (a package manager used by NixOS for this task) all you have to do to edit the standard system is boot up, edit a file called =/etc/nixos/configuration.nix= and then type =nixos-rebuild switch=

Everything material is stored in the config file. That file looks like this:

#+BEGIN_SRC nix
{ config, pkgs, ... }:

{
  # Basic machine identity
  networking.hostName = "little-nixbox";

  # Pick a system state version once and do not casually change it.
  system.stateVersion = "25.11";

  # Enable SSH
  services.openssh.enable = true;

  # Create a user
  users.users.john = {
    isNormalUser = true;
    extraGroups = [ "wheel" ];
    shell = pkgs.fish;
  };

  # Install system packages
  environment.systemPackages = with pkgs; [
    git
    vim
    fish
    htop
  ];

  # Enable fish system-wide
  programs.fish.enable = true;

  # A simple custom file
  environment.etc."motd".text = ''
    Welcome to ${config.networking.hostName}.
    This machine is declared in Nix.
  '';
}
#+END_SRC

If  you are an experienced user who has worked with Linux administration on a superficial level you probably already grasp the basics here.

We create a user, give him some permissions (but not too many), change his shell and install few programs for him to use. Additionally we are editing the message that shows up on =motd=.

Now, in fairness much of this *could* theoretically be replicated with shell scripts. Docker is a big fan of this style. Here is how some of that that would look on a Debian based system:
#+BEGIN_SRC bash
#!/usr/bin/env bash
# Don't run this. 
apt update

apt install -y \
  git \
  fish \
  emacs

useradd -m john

echo "PermitRootLogin no" >> /etc/ssh/sshd_config

systemctl restart sshd
systemctl enable sshd
#+END_SRC

Now, that isn't bad. In fact it is a good deal more sophisticated than average. But really it doesn't provide the same sort of guardrails or capabilities Nix does.

First of all, it is not [[https://en.wikipedia.org/wiki/Idempotence][idempotent.]] That means that if the user =john= already exists then things start acting a bit... off. It is also fundamentally a sequence of actions to be executed in order. Nix is all or nothing. If one step in that script failed then it is an open question if we want the rest of it to run. We can add in =ifs= (and people certainly do) but it isn't a cohesive answer to the question of "What do we want this system to look like?"
*** A big bunch of nerd /minutiae/
There are two schools of thought on use of the nix package manager. (Actually there may be more schools of thought than Nix users...) One way uses the standard configuration file at =/etc/nixos/configuration.nix=. The other uses something called a /flake/

We will be using flakes eventually because they offer more features. But honestly at this point it is a distinction without much difference. All you have to know is this is something we will have to opt into. I just want to make you aware so that you don't get confused later. 
