exports/inventory.html
<div id="outline-container-org062fb2c" class="outline-2">
<h2 id="org062fb2c"><span class="section-number-2">3.</span> Declarative Systems with <code>nix</code></h2>
<div class="outline-text-2" id="text-3">
<p>
For those unaware NixOS allows you to describe your configuration as text directly. Think of it at first as a series of breadcrumbs. On an Ubuntu system you begin with a standard image, then type a series of commands. Each of these commands has a side effect that changes the configuration of your system. (Typically adding or removing software via apt or editing a file in /etc, for instance.) You may or may not be able to replicate your system from the first command to the last and arrive at your configuration. The system is fundamentally ephemeral.
</p>

<p>
A nix system on the other hand defines itself (insists upon itself, some say.) You or an LLM buddy describe what you want and then the nix package manager makes it happen.
</p>

<p>
It is fundamentally <i>declarative.</i>
</p>

<p>
Using <code>nix</code> (a package manager used by NixOS for this task) all you have to do to edit the standard system is boot up, edit a file called <code>/etc/nixos/configuration.nix</code> and then type <code>nixos-rebuild switch</code>
</p>

<p>
Everything material is stored in the config file. It looks like this:
</p>

<div class="org-src-container">
<pre class="src src-nix">{ config, pkgs, ... }:

{
  <span class="org-comment"># Basic machine identity
</span>  <span class="org-nix-attribute">networking.hostName</span> = <span class="org-string">"little-nixbox"</span>;

  <span class="org-comment"># Pick a system state version once and do not casually change it.
</span>  <span class="org-nix-attribute">system.stateVersion</span> = <span class="org-string">"25.11"</span>;

  <span class="org-comment"># Enable SSH
</span>  <span class="org-nix-attribute">services.openssh.enable</span> = <span class="org-nix-builtin">true</span>;

  <span class="org-comment"># Create a user
</span>  <span class="org-nix-attribute">users.users.john</span> = {
    <span class="org-nix-attribute">isNormalUser</span> = <span class="org-nix-builtin">true</span>;
    <span class="org-nix-attribute">extraGroups</span> = [ <span class="org-string">"wheel"</span> ];
    <span class="org-nix-attribute">shell</span> = pkgs.fish;
  };

  <span class="org-comment"># Install system packages
</span>  <span class="org-nix-attribute">environment.systemPackages</span> = <span class="org-nix-keyword">with</span> pkgs; [
    git
    vim
    fish
    htop
  ];

  <span class="org-comment"># Enable fish system-wide
</span>  <span class="org-nix-attribute">programs.fish.enable</span> = <span class="org-nix-builtin">true</span>;

  <span class="org-comment"># A simple custom file
</span>  environment.etc.<span class="org-string">"motd"</span>.<span class="org-nix-attribute">text</span> = <span class="org-string">''
    Welcome to </span><span class="org-nix-antiquote">${</span>config.networking.hostName<span class="org-nix-antiquote">}</span><span class="org-string">.
    This machine is declared in Nix.
  ''</span>;
}
</pre>
</div>

<p>
If  you are an experienced user who has worked with Linux administration on a superficial level you probably already grasp the basics here.
</p>

<p>
We create a user, give him some permissions, change his shell and install few programs. Additionally we are editing the message that shows up on <code>motd</code>.
</p>

<p>
Now, in fairness much of this <b>could</b> theoretically be replicated with shell scripts. Docker is a big fan of this style. Here is how some of that that would look on a Debian based system:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/</span><span class="org-keyword">env</span><span class="org-comment"> bash
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Don't run this. 
</span>apt update

apt install -y <span class="org-sh-escaped-newline">\</span>
  git <span class="org-sh-escaped-newline">\</span>
  fish <span class="org-sh-escaped-newline">\</span>
  emacs

useradd -m john

<span class="org-builtin">echo</span> <span class="org-string">"PermitRootLogin no"</span> &gt;&gt; /etc/ssh/sshd_config

systemctl restart sshd
systemctl enable sshd
</pre>
</div>

<p>
Now, that isn't bad. In fact it is a good deal more sophisticated than average. But really it doesn't provide the same sort of guardrails or capabilities Nix does.
</p>

<p>
First of all, it is not <a href="https://en.wikipedia.org/wiki/Idempotence">idempotent.</a> That means that if the user <code>john</code> already exists then things start acting a bit&#x2026; off. It is also fundamentally a sequence of actions to be executed in order. Nix is all or nothing. If one step in that script failed then it is an open question if we want the rest of it to run. We can add in <code>ifs</code> (and people certainly do) but it isn't a cohesive answer to the question of "What do we want this system to look like?"
</p>
</div>
<div id="outline-container-org5457c44" class="outline-4">
<h4 id="org5457c44"><span class="section-number-4">3.0.1.</span> A big bunch of <i>minutiae</i></h4>
<div class="outline-text-4" id="text-3-0-1">
<p>
There are two schools of thought on use of the nix package manager. (Actually there may be more schools of thought than Nix users&#x2026;) One way uses the standard configuration file at <code>/etc/nixos/configuration.nix</code>. The other uses something called a <i>flake</i>
</p>

<p>
We will be using flakes eventually because they offer more features. But honestly at this point it is a distinction without much difference. All you have to know is this is something we will have to opt into. I just want to make you aware so that you don't get confused later. 
</p>
</div>
</div>
