exports/inventory.html
<div id="outline-container-orge117819" class="outline-3">
<h3 id="orge117819"><span class="section-number-3">3.1.</span> Using <code>nix</code> for multiple machines</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A likely split is:
</p>
<ul class="org-ul">
<li><code>hosts.</code> for machine/system inventory</li>
<li><code>homes.</code> for user/home-manager inventory</li>
<li><code>roles.</code> for descriptive metadata about what roles mean</li>
</ul>

<p>
The TOML should probably stay mostly declarative and boring:
</p>
<ul class="org-ul">
<li>hostnames</li>
<li>systems / architectures</li>
<li>enabled roles</li>
<li>package groups</li>
<li>usernames</li>
<li>simple flags</li>
<li>references to secret names or files</li>
</ul>

<p>
The Nix side should do the interesting work:
</p>
<ul class="org-ul">
<li>map inventory data into Snowfall modules</li>
<li>apply defaults</li>
<li>merge role arrays and attrset-style role configs</li>
<li>handle complicated conditional logic</li>
<li>derive imports and secret wiring</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org66dcf1e" class="outline-2">
<h2 id="org66dcf1e"><span class="section-number-2">4.</span> The Life and Labs of John Lambert, Gentleman</h2>
<div class="outline-text-2" id="text-4">
<p>
This section is intentionally prose-heavy. It should help answer the question:
"What does this role <b>mean</b> in this repo?"
</p>
</div>
<div id="outline-container-org66bc2b5" class="outline-3">
<h3 id="org66bc2b5"><span class="section-number-3">4.1.</span> System roles</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgc9091b9" class="outline-4">
<h4 id="orgc9091b9"><span class="section-number-4">4.1.1.</span> ssh</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Enable remote SSH access and harden it a bit.
</p>
</div>
</div>
<div id="outline-container-orgb46edf1" class="outline-4">
<h4 id="orgb46edf1"><span class="section-number-4">4.1.2.</span> tailscale</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Enable Tailscale mesh VPN support. This role already has richer configuration
than a plain boolean, so it is a good example of why inventory data and Nix
logic should cooperate rather than compete.
</p>
</div>
</div>
<div id="outline-container-orgf991478" class="outline-4">
<h4 id="orgf991478"><span class="section-number-4">4.1.3.</span> fish</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Install / enable fish at the system level.
</p>
</div>
</div>
<div id="outline-container-org7349a5c" class="outline-4">
<h4 id="org7349a5c"><span class="section-number-4">4.1.4.</span> chrome</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
Install Google Chrome.
</p>
</div>
</div>
<div id="outline-container-orgd3ae9c4" class="outline-4">
<h4 id="orgd3ae9c4"><span class="section-number-4">4.1.5.</span> blender</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
Install Blender.
</p>
</div>
</div>
<div id="outline-container-orgc40bd91" class="outline-4">
<h4 id="orgc40bd91"><span class="section-number-4">4.1.6.</span> arm<sub>builder</sub></h4>
<div class="outline-text-4" id="text-4-1-6">
<p>
Turn a machine into a cross-arch builder for ARM targets via binfmt/QEMU.
This is especially useful for building Raspberry Pi images from a stronger x86
workstation.
</p>
</div>
</div>
<div id="outline-container-org8132cc8" class="outline-4">
<h4 id="org8132cc8"><span class="section-number-4">4.1.7.</span> xmonad</h4>
<div class="outline-text-4" id="text-4-1-7">
<p>
Enable the XMonad desktop/session setup.
</p>
</div>
</div>
<div id="outline-container-orgffa5948" class="outline-4">
<h4 id="orgffa5948"><span class="section-number-4">4.1.8.</span> desktop.pantheon</h4>
<div class="outline-text-4" id="text-4-1-8">
<p>
Enable Pantheon desktop components.
</p>
</div>
</div>
<div id="outline-container-org003739e" class="outline-4">
<h4 id="org003739e"><span class="section-number-4">4.1.9.</span> homeassistant</h4>
<div class="outline-text-4" id="text-4-1-9">
<p>
Run Home Assistant, currently via OCI containers.
</p>
</div>
</div>
<div id="outline-container-org1e8fd57" class="outline-4">
<h4 id="org1e8fd57"><span class="section-number-4">4.1.10.</span> cockpit</h4>
<div class="outline-text-4" id="text-4-1-10">
<p>
Enable Cockpit for web-based machine management.
</p>
</div>
</div>
<div id="outline-container-org46b83d9" class="outline-4">
<h4 id="org46b83d9"><span class="section-number-4">4.1.11.</span> dynamic<sub>dns</sub></h4>
<div class="outline-text-4" id="text-4-1-11">
<p>
Enable DuckDNS / ddclient style dynamic DNS updates.
</p>
</div>
</div>
<div id="outline-container-orgaa6e7bf" class="outline-4">
<h4 id="orgaa6e7bf"><span class="section-number-4">4.1.12.</span> wg-easy</h4>
<div class="outline-text-4" id="text-4-1-12">
<p>
Run wg-easy, the WireGuard web UI, with a bit more structured configuration
than a simple boolean.
</p>
</div>
</div>
</div>
<div id="outline-container-orgda18cac" class="outline-3">
<h3 id="orgda18cac"><span class="section-number-3">4.2.</span> Home roles / modules</h3>
<div class="outline-text-3" id="text-4-2">
<p>
These are currently expressed as Home Manager modules under <code>modules/home/</code>.
</p>
</div>
<div id="outline-container-org522fe46" class="outline-4">
<h4 id="org522fe46"><span class="section-number-4">4.2.1.</span> emacs</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Main editor / writing environment. Increasingly Org-centric, now with a
literate init.
</p>
</div>
</div>
<div id="outline-container-org32408fd" class="outline-4">
<h4 id="org32408fd"><span class="section-number-4">4.2.2.</span> nvim</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Neovim setup.
</p>
</div>
</div>
<div id="outline-container-org8105564" class="outline-4">
<h4 id="org8105564"><span class="section-number-4">4.2.3.</span> fish</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
User-level fish shell configuration and aliases.
</p>
</div>
</div>
<div id="outline-container-org6da2fd6" class="outline-4">
<h4 id="org6da2fd6"><span class="section-number-4">4.2.4.</span> fonts</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
Fonts useful for desktop/icon-heavy setups.
</p>
</div>
</div>
<div id="outline-container-org696d653" class="outline-4">
<h4 id="org696d653"><span class="section-number-4">4.2.5.</span> aider</h4>
<div class="outline-text-4" id="text-4-2-5">
<p>
Aider integration.
</p>
</div>
</div>
<div id="outline-container-orgc16b789" class="outline-4">
<h4 id="orgc16b789"><span class="section-number-4">4.2.6.</span> pi</h4>
<div class="outline-text-4" id="text-4-2-6">
<p>
pi coding agent integration and user config.
</p>
</div>
</div>
<div id="outline-container-org888378c" class="outline-4">
<h4 id="org888378c"><span class="section-number-4">4.2.7.</span> sops</h4>
<div class="outline-text-4" id="text-4-2-7">
<p>
User-level secret tooling.
</p>
</div>
</div>
<div id="outline-container-org927eac4" class="outline-4">
<h4 id="org927eac4"><span class="section-number-4">4.2.8.</span> direnv</h4>
<div class="outline-text-4" id="text-4-2-8">
<p>
direnv and nix-direnv integration.
</p>
</div>
</div>
<div id="outline-container-org988e23c" class="outline-4">
<h4 id="org988e23c"><span class="section-number-4">4.2.9.</span> xmonad</h4>
<div class="outline-text-4" id="text-4-2-9">
<p>
User-level XMonad support files.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org680d3c6" class="outline-2">
<h2 id="org680d3c6"><span class="section-number-2">5.</span> Current machines</h2>
<div class="outline-text-2" id="text-5">
</div>
