inventory.tex
\subsection{Using \texttt{nix} for multiple machines}
\label{sec:org12eca6c}
A likely split is:
\begin{itemize}
\item \texttt{hosts.} for machine/system inventory
\item \texttt{homes.} for user/home-manager inventory
\item \texttt{roles.} for descriptive metadata about what roles mean
\end{itemize}

The TOML should probably stay mostly declarative and boring:
\begin{itemize}
\item hostnames
\item systems / architectures
\item enabled roles
\item package groups
\item usernames
\item simple flags
\item references to secret names or files
\end{itemize}

The Nix side should do the interesting work:
\begin{itemize}
\item map inventory data into Snowfall modules
\item apply defaults
\item merge role arrays and attrset-style role configs
\item handle complicated conditional logic
\item derive imports and secret wiring
\end{itemize}
\section{The Life and Labs of John Lambert, Gentleman}
\label{sec:org9e59b1c}

This section is intentionally prose-heavy. It should help answer the question:
"What does this role \textbf{mean} in this repo?"
\subsection{System roles}
\label{sec:org4615a10}

\subsubsection{ssh}
\label{sec:org74299e3}
Enable remote SSH access and harden it a bit.
\subsubsection{tailscale}
\label{sec:orgda5c59a}
Enable Tailscale mesh VPN support. This role already has richer configuration
than a plain boolean, so it is a good example of why inventory data and Nix
logic should cooperate rather than compete.
\subsubsection{fish}
\label{sec:org2cf3f63}
Install / enable fish at the system level.
\subsubsection{chrome}
\label{sec:orgca69cec}
Install Google Chrome.
\subsubsection{blender}
\label{sec:orgb513a98}
Install Blender.
\subsubsection{arm\textsubscript{builder}}
\label{sec:org5e0a6c6}
Turn a machine into a cross-arch builder for ARM targets via binfmt/QEMU.
This is especially useful for building Raspberry Pi images from a stronger x86
workstation.
\subsubsection{xmonad}
\label{sec:org551296f}
Enable the XMonad desktop/session setup.
\subsubsection{desktop.pantheon}
\label{sec:org7d7be0e}
Enable Pantheon desktop components.
\subsubsection{homeassistant}
\label{sec:org906f678}
Run Home Assistant, currently via OCI containers.
\subsubsection{cockpit}
\label{sec:org82ab0c5}
Enable Cockpit for web-based machine management.
\subsubsection{dynamic\textsubscript{dns}}
\label{sec:org460a470}
Enable DuckDNS / ddclient style dynamic DNS updates.
\subsubsection{wg-easy}
\label{sec:org8edcf51}
Run wg-easy, the WireGuard web UI, with a bit more structured configuration
than a simple boolean.
\subsection{Home roles / modules}
\label{sec:org515265d}

These are currently expressed as Home Manager modules under \texttt{modules/home/}.
\subsubsection{emacs}
\label{sec:org8598fd6}
Main editor / writing environment. Increasingly Org-centric, now with a
literate init.
\subsubsection{nvim}
\label{sec:org28c3394}
Neovim setup.
\subsubsection{fish}
\label{sec:org3aeb013}
User-level fish shell configuration and aliases.
\subsubsection{fonts}
\label{sec:org11ef962}
Fonts useful for desktop/icon-heavy setups.
\subsubsection{aider}
\label{sec:org8e47a4a}
Aider integration.
\subsubsection{pi}
\label{sec:org99f7751}
pi coding agent integration and user config.
\subsubsection{sops}
\label{sec:org6ad7be3}
User-level secret tooling.
\subsubsection{direnv}
\label{sec:org27cc591}
direnv and nix-direnv integration.
\subsubsection{xmonad}
\label{sec:org8533c2f}
User-level XMonad support files.
\section{Current machines}
\label{sec:org1861ed8}
