exports/inventory.html
<div id="outline-container-org7fc7b14" class="outline-3">
<h3 id="org7fc7b14"><span class="section-number-3">5.1.</span> IvyMike</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Primary active x86<sub>64</sub> workstation.
</p>

<p>
Observed system characteristics:
</p>
<ul class="org-ul">
<li>hostname: <code>IvyMike</code></li>
<li>system: <code>x86_64-linux</code></li>
<li>state version: <code>25.11</code></li>
<li>imports hardware from <code>systems/x86_64-linux/IvyMike/hardware.nix</code></li>
<li>boots with systemd-boot + EFI</li>
<li>printing enabled</li>
<li>SOPS host file based on hostname</li>
</ul>

<p>
Current system roles:
</p>
<ul class="org-ul">
<li>chrome</li>
<li>fish</li>
<li>blender</li>
<li>arm<sub>builder</sub></li>
<li>desktop.pantheon</li>
<li>xmonad</li>
<li>ssh</li>
<li>tailscale</li>
</ul>

<p>
Current home for <code>john@IvyMike</code>:
</p>
<ul class="org-ul">
<li>fish</li>
<li>emacs</li>
<li>direnv</li>
<li>nvim</li>
<li>fonts</li>
<li>aider</li>
<li>pi</li>
<li>sops</li>
<li>xmonad</li>
</ul>

<p>
Notes:
</p>
<ul class="org-ul">
<li>This appears to be the center of gravity for development.</li>
<li>It is also the machine most likely to benefit from an eventual inventory-
driven host definition.</li>
<li><code>~/chronofile</code> is the key home-level knowledge base.</li>
</ul>
</div>
</div>
<div id="outline-container-org40187c5" class="outline-3">
<h3 id="org40187c5"><span class="section-number-3">5.2.</span> server</h3>
<div class="outline-text-3" id="text-5-2">
<p>
x86<sub>64</sub> machine with a more service-heavy mix.
</p>

<p>
Observed system characteristics:
</p>
<ul class="org-ul">
<li>hostname: <code>server</code></li>
<li>system: <code>x86_64-linux</code></li>
<li>state version: <code>24.11</code></li>
</ul>

<p>
Current system roles:
</p>
<ul class="org-ul">
<li>chrome</li>
<li>dynamic<sub>dns</sub></li>
<li>fish</li>
<li>wg-easy</li>
<li>homeassistant</li>
<li>desktop.pantheon</li>
<li>cockpit</li>
<li>ssh</li>
<li>tailscale</li>
</ul>

<p>
Current home for <code>john@server</code>:
</p>
<ul class="org-ul">
<li>fish</li>
<li>emacs</li>
<li>nvim</li>
<li>fonts</li>
<li>aider</li>
<li>pi</li>
</ul>

<p>
Notes:
</p>
<ul class="org-ul">
<li>This one looks like a mixed-use service host rather than a pure headless box.</li>
<li>wg-easy and dynamic DNS make it a good example of a host with more than just
boolean role toggles.</li>
</ul>
</div>
</div>
<div id="outline-container-orga3ab6d7" class="outline-3">
<h3 id="orga3ab6d7"><span class="section-number-3">5.3.</span> malacabeza</h3>
<div class="outline-text-3" id="text-5-3">
<p>
ARM/Raspberry Pi style machine.
</p>

<p>
Observed system characteristics:
</p>
<ul class="org-ul">
<li>hostname: <code>malacabeza</code></li>
<li>system: <code>aarch64-linux</code></li>
<li>state version: <code>25.11</code></li>
<li>uses the sd-image aarch64 installer profile</li>
<li>wireless is configured through SOPS-backed secrets</li>
<li>kernel/packages tuned for Raspberry Pi 4</li>
</ul>

<p>
Current role-ish identity:
</p>
<ul class="org-ul">
<li>not heavily using the shared role modules yet</li>
<li>direct OpenSSH configuration</li>
<li>fish enabled</li>
<li>lightweight system packages for recovery/bootstrap</li>
</ul>

<p>
Notes:
</p>
<ul class="org-ul">
<li>This is a useful reminder that not everything has to be role-driven on day 1.</li>
<li>It may eventually want inventory fields for image-building, Wi-Fi, and board
type.</li>
</ul>
</div>
</div>
<div id="outline-container-org5299afe" class="outline-3">
<h3 id="org5299afe"><span class="section-number-3">5.4.</span> malacabeza-vm</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Aarch64 QEMU VM for testing and image iteration.
</p>

<p>
Observed system characteristics:
</p>
<ul class="org-ul">
<li>hostname: <code>malacabeza-vm</code></li>
<li>system: <code>aarch64-linux</code></li>
<li>state version: <code>25.11</code></li>
<li>qcow2 image</li>
<li>EFI boot</li>
<li>reduced docs/man output for faster iteration</li>
<li>SSH forwarded from host port <code>2223</code></li>
</ul>

<p>
Current system roles:
</p>
<ul class="org-ul">
<li>homeassistant</li>
</ul>

<p>
Notes:
</p>
<ul class="org-ul">
<li>This is a strong candidate for inventory-driven virtualization metadata.</li>
<li>Good place to test role composition without touching real hardware.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org645a6e6" class="outline-2">
<h2 id="org645a6e6"><span class="section-number-2">6.</span> Current homes</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org5fe392d" class="outline-3">
<h3 id="org5fe392d"><span class="section-number-3">6.1.</span> john@IvyMike</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Most feature-rich home profile right now.
</p>

<p>
Themes:
</p>
<ul class="org-ul">
<li>editor-heavy</li>
<li>Org-heavy</li>
<li>AI-tool-heavy</li>
<li>desktop/XMonad capable</li>
<li>secret-aware via sops</li>
</ul>
</div>
</div>
<div id="outline-container-org35e9d62" class="outline-3">
<h3 id="org35e9d62"><span class="section-number-3">6.2.</span> john@server</h3>
<div class="outline-text-3" id="text-6-2">
<p>
A lighter home profile than IvyMike, but still editor/AI capable.
</p>
</div>
</div>
<div id="outline-container-org03857ff" class="outline-3">
<h3 id="org03857ff"><span class="section-number-3">6.3.</span> john@cookiesheet</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Looks similar to the shared desktop/editor pattern:
</p>
<ul class="org-ul">
<li>fish</li>
<li>emacs</li>
<li>direnv</li>
<li>nvim</li>
<li>fonts</li>
<li>aider</li>
<li>pi</li>
<li>sops</li>
</ul>

<p>
This suggests there is already an emerging "standard John desktop home" shape.
</p>
</div>
</div>
</div>
