inventory.tex

\subsection{IvyMike}
\label{sec:orga5864a6}
Primary active x86\textsubscript{64} workstation.

Observed system characteristics:
\begin{itemize}
\item hostname: \texttt{IvyMike}
\item system: \texttt{x86\_64-linux}
\item state version: \texttt{25.11}
\item imports hardware from \texttt{systems/x86\_64-linux/IvyMike/hardware.nix}
\item boots with systemd-boot + EFI
\item printing enabled
\item SOPS host file based on hostname
\end{itemize}

Current system roles:
\begin{itemize}
\item chrome
\item fish
\item blender
\item arm\textsubscript{builder}
\item desktop.pantheon
\item xmonad
\item ssh
\item tailscale
\end{itemize}

Current home for \texttt{john@IvyMike}:
\begin{itemize}
\item fish
\item emacs
\item direnv
\item nvim
\item fonts
\item aider
\item pi
\item sops
\item xmonad
\end{itemize}

Notes:
\begin{itemize}
\item This appears to be the center of gravity for development.
\item It is also the machine most likely to benefit from an eventual inventory-
driven host definition.
\item \texttt{\textasciitilde{}/chronofile} is the key home-level knowledge base.
\end{itemize}
\subsection{server}
\label{sec:org9b56f94}
x86\textsubscript{64} machine with a more service-heavy mix.

Observed system characteristics:
\begin{itemize}
\item hostname: \texttt{server}
\item system: \texttt{x86\_64-linux}
\item state version: \texttt{24.11}
\end{itemize}

Current system roles:
\begin{itemize}
\item chrome
\item dynamic\textsubscript{dns}
\item fish
\item wg-easy
\item homeassistant
\item desktop.pantheon
\item cockpit
\item ssh
\item tailscale
\end{itemize}

Current home for \texttt{john@server}:
\begin{itemize}
\item fish
\item emacs
\item nvim
\item fonts
\item aider
\item pi
\end{itemize}

Notes:
\begin{itemize}
\item This one looks like a mixed-use service host rather than a pure headless box.
\item wg-easy and dynamic DNS make it a good example of a host with more than just
boolean role toggles.
\end{itemize}
\subsection{malacabeza}
\label{sec:org3f3b810}
ARM/Raspberry Pi style machine.

Observed system characteristics:
\begin{itemize}
\item hostname: \texttt{malacabeza}
\item system: \texttt{aarch64-linux}
\item state version: \texttt{25.11}
\item uses the sd-image aarch64 installer profile
\item wireless is configured through SOPS-backed secrets
\item kernel/packages tuned for Raspberry Pi 4
\end{itemize}

Current role-ish identity:
\begin{itemize}
\item not heavily using the shared role modules yet
\item direct OpenSSH configuration
\item fish enabled
\item lightweight system packages for recovery/bootstrap
\end{itemize}

Notes:
\begin{itemize}
\item This is a useful reminder that not everything has to be role-driven on day 1.
\item It may eventually want inventory fields for image-building, Wi-Fi, and board
type.
\end{itemize}
\subsection{malacabeza-vm}
\label{sec:org38c969b}
Aarch64 QEMU VM for testing and image iteration.

Observed system characteristics:
\begin{itemize}
\item hostname: \texttt{malacabeza-vm}
\item system: \texttt{aarch64-linux}
\item state version: \texttt{25.11}
\item qcow2 image
\item EFI boot
\item reduced docs/man output for faster iteration
\item SSH forwarded from host port \texttt{2223}
\end{itemize}

Current system roles:
\begin{itemize}
\item homeassistant
\end{itemize}

Notes:
\begin{itemize}
\item This is a strong candidate for inventory-driven virtualization metadata.
\item Good place to test role composition without touching real hardware.
\end{itemize}
\section{Current homes}
\label{sec:orged87b2d}

\subsection{john@IvyMike}
\label{sec:orga7a0a55}
Most feature-rich home profile right now.

Themes:
\begin{itemize}
\item editor-heavy
\item Org-heavy
\item AI-tool-heavy
\item desktop/XMonad capable
\item secret-aware via sops
\end{itemize}
\subsection{john@server}
\label{sec:orgd3d2e7d}
A lighter home profile than IvyMike, but still editor/AI capable.
\subsection{john@cookiesheet}
\label{sec:org5bd4e15}
Looks similar to the shared desktop/editor pattern:
\begin{itemize}
\item fish
\item emacs
\item direnv
\item nvim
\item fonts
\item aider
\item pi
\item sops
\end{itemize}

This suggests there is already an emerging "standard John desktop home" shape.
