inventory.org
* Inventory sketch

This is not authoritative yet. It is just a candidate shape for a future
inventory file.

#+begin_src toml :tangle inventory.toml
[hosts.IvyMike]
system = "x86_64-linux"
hostname = "IvyMike"
stateVersion = "25.11"
roles = [
  "chrome",
  "fish",
  "blender",
  "arm_builder",
  "xmonad",
  "ssh",
  "tailscale",
  "desktop.pantheon",
]

[homes."john@IvyMike"]
modules = [
  "fish",
  "emacs",
  "direnv",
  "nvim",
  "fonts",
  "aider",
  "pi",
  "sops",
  "xmonad",
]

[hosts.server]
system = "x86_64-linux"
hostname = "server"
stateVersion = "24.11"
roles = [
  "chrome",
  "dynamic_dns",
  "fish",
  "homeassistant",
  "cockpit",
  "ssh",
  "tailscale",
  "desktop.pantheon",
  "wg-easy",
]

[homes."john@server"]
modules = [
  "fish",
  "emacs",
  "nvim",
  "fonts",
  "aider",
  "pi",
]

[hosts.malacabeza]
system = "aarch64-linux"
hostname = "malacabeza"
stateVersion = "25.11"
notes = "Raspberry Pi / sd-image oriented host"

[hosts."malacabeza-vm"]
system = "aarch64-linux"
hostname = "malacabeza-vm"
stateVersion = "25.11"
roles = ["homeassistant"]
notes = "QEMU VM for ARM/home-assistant iteration"
#+end_src

* TODOs

** TODO Decide whether the repo should standardize on =inventory.org -> inventory.toml= or jump straight to =inventory.nix=
** TODO Add a role metadata section that maps role names to module paths
** TODO Add home-module metadata section
** TODO Decide how secrets should be referenced in inventory data
** TODO Decide whether nested roles should live as dotted strings, nested TOML tables, or both
** TODO Prototype a Nix helper that reads =inventory.toml= and projects it into Snowfall role toggles
