exports/inventory.html
<div id="outline-container-org2cdaf32" class="outline-2">
<h2 id="org2cdaf32"><span class="section-number-2">7.</span> Inventory sketch</h2>
<div class="outline-text-2" id="text-7">
<p>
This is not authoritative yet. It is just a candidate shape for a future
inventory file.
</p>

<div class="org-src-container">
<pre class="src src-toml">[<span class="org-type">hosts.IvyMike</span>]
<span class="org-variable-name">system</span> = <span class="org-string">"x86_64-linux"</span>
<span class="org-variable-name">hostname</span> = <span class="org-string">"IvyMike"</span>
<span class="org-variable-name">stateVersion</span> = <span class="org-string">"25.11"</span>
<span class="org-variable-name">roles</span> = [
  <span class="org-string">"chrome"</span>,
  <span class="org-string">"fish"</span>,
  <span class="org-string">"blender"</span>,
  <span class="org-string">"arm_builder"</span>,
  <span class="org-string">"xmonad"</span>,
  <span class="org-string">"ssh"</span>,
  <span class="org-string">"tailscale"</span>,
  <span class="org-string">"desktop.pantheon"</span>,
]

[<span class="org-type">homes.</span><span class="org-string"><span class="org-type">"john@IvyMike"</span></span>]
<span class="org-variable-name">modules</span> = [
  <span class="org-string">"fish"</span>,
  <span class="org-string">"emacs"</span>,
  <span class="org-string">"direnv"</span>,
  <span class="org-string">"nvim"</span>,
  <span class="org-string">"fonts"</span>,
  <span class="org-string">"aider"</span>,
  <span class="org-string">"pi"</span>,
  <span class="org-string">"sops"</span>,
  <span class="org-string">"xmonad"</span>,
]

[<span class="org-type">hosts.server</span>]
<span class="org-variable-name">system</span> = <span class="org-string">"x86_64-linux"</span>
<span class="org-variable-name">hostname</span> = <span class="org-string">"server"</span>
<span class="org-variable-name">stateVersion</span> = <span class="org-string">"24.11"</span>
<span class="org-variable-name">roles</span> = [
  <span class="org-string">"chrome"</span>,
  <span class="org-string">"dynamic_dns"</span>,
  <span class="org-string">"fish"</span>,
  <span class="org-string">"homeassistant"</span>,
  <span class="org-string">"cockpit"</span>,
  <span class="org-string">"ssh"</span>,
  <span class="org-string">"tailscale"</span>,
  <span class="org-string">"desktop.pantheon"</span>,
  <span class="org-string">"wg-easy"</span>,
]

[<span class="org-type">homes.</span><span class="org-string"><span class="org-type">"john@server"</span></span>]
<span class="org-variable-name">modules</span> = [
  <span class="org-string">"fish"</span>,
  <span class="org-string">"emacs"</span>,
  <span class="org-string">"nvim"</span>,
  <span class="org-string">"fonts"</span>,
  <span class="org-string">"aider"</span>,
  <span class="org-string">"pi"</span>,
]

[<span class="org-type">hosts.malacabeza</span>]
<span class="org-variable-name">system</span> = <span class="org-string">"aarch64-linux"</span>
<span class="org-variable-name">hostname</span> = <span class="org-string">"malacabeza"</span>
<span class="org-variable-name">stateVersion</span> = <span class="org-string">"25.11"</span>
<span class="org-variable-name">notes</span> = <span class="org-string">"Raspberry Pi / sd-image oriented host"</span>

[<span class="org-type">hosts.</span><span class="org-string"><span class="org-type">"malacabeza-vm"</span></span>]
<span class="org-variable-name">system</span> = <span class="org-string">"aarch64-linux"</span>
<span class="org-variable-name">hostname</span> = <span class="org-string">"malacabeza-vm"</span>
<span class="org-variable-name">stateVersion</span> = <span class="org-string">"25.11"</span>
<span class="org-variable-name">roles</span> = [<span class="org-string">"homeassistant"</span>]
<span class="org-variable-name">notes</span> = <span class="org-string">"QEMU VM for ARM/home-assistant iteration"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb39cbfa" class="outline-2">
<h2 id="orgb39cbfa"><span class="section-number-2">8.</span> TODOs</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org1bcbf61" class="outline-3">
<h3 id="org1bcbf61"><span class="section-number-3">8.1.</span> <span class="todo TODO">TODO</span> Decide whether the repo should standardize on <code>inventory.org -&gt; inventory.toml</code> or jump straight to <code>inventory.nix</code></h3>
</div>
<div id="outline-container-orgae48c08" class="outline-3">
<h3 id="orgae48c08"><span class="section-number-3">8.2.</span> <span class="todo TODO">TODO</span> Add a role metadata section that maps role names to module paths</h3>
</div>
<div id="outline-container-orge5e29a0" class="outline-3">
<h3 id="orge5e29a0"><span class="section-number-3">8.3.</span> <span class="todo TODO">TODO</span> Add home-module metadata section</h3>
</div>
<div id="outline-container-org6f6147a" class="outline-3">
<h3 id="org6f6147a"><span class="section-number-3">8.4.</span> <span class="todo TODO">TODO</span> Decide how secrets should be referenced in inventory data</h3>
</div>
<div id="outline-container-org5f7f7a0" class="outline-3">
<h3 id="org5f7f7a0"><span class="section-number-3">8.5.</span> <span class="todo TODO">TODO</span> Decide whether nested roles should live as dotted strings, nested TOML tables, or both</h3>
</div>
<div id="outline-container-org9f10340" class="outline-3">
<h3 id="org9f10340"><span class="section-number-3">8.6.</span> <span class="todo TODO">TODO</span> Prototype a Nix helper that reads <code>inventory.toml</code> and projects it into Snowfall role toggles</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Lambert</p>
<p class="date">Created: 2026-06-02 Tue 18:18</p>
</div>
</body>
</html>
