inventory.tex
\section{Inventory sketch}
\label{sec:org7cf0c9e}

This is not authoritative yet. It is just a candidate shape for a future
inventory file.

\begin{verbatim}
[hosts.IvyMike]
system = "x86_64-linux"
hostname = "IvyMike"
stateVersion = "25.11"
roles = [
  "chrome",
  "fish",
  "blender",
  "arm_builder",
  "xmonad",
  "ssh",
  "tailscale",
  "desktop.pantheon",
]

[homes."john@IvyMike"]
modules = [
  "fish",
  "emacs",
  "direnv",
  "nvim",
  "fonts",
  "aider",
  "pi",
  "sops",
  "xmonad",
]

[hosts.server]
system = "x86_64-linux"
hostname = "server"
stateVersion = "24.11"
roles = [
  "chrome",
  "dynamic_dns",
  "fish",
  "homeassistant",
  "cockpit",
  "ssh",
  "tailscale",
  "desktop.pantheon",
  "wg-easy",
]

[homes."john@server"]
modules = [
  "fish",
  "emacs",
  "nvim",
  "fonts",
  "aider",
  "pi",
]

[hosts.malacabeza]
system = "aarch64-linux"
hostname = "malacabeza"
stateVersion = "25.11"
notes = "Raspberry Pi / sd-image oriented host"

[hosts."malacabeza-vm"]
system = "aarch64-linux"
hostname = "malacabeza-vm"
stateVersion = "25.11"
roles = ["homeassistant"]
notes = "QEMU VM for ARM/home-assistant iteration"
\end{verbatim}
\section{TODOs}
\label{sec:orgab92d58}

\subsection{{\bfseries\sffamily TODO} Decide whether the repo should standardize on \texttt{inventory.org -> inventory.toml} or jump straight to \texttt{inventory.nix}}
\label{sec:orgbb27944}
\subsection{{\bfseries\sffamily TODO} Add a role metadata section that maps role names to module paths}
\label{sec:org0acad7e}
\subsection{{\bfseries\sffamily TODO} Add home-module metadata section}
\label{sec:orge035d9e}
\subsection{{\bfseries\sffamily TODO} Decide how secrets should be referenced in inventory data}
\label{sec:org3df9fbf}
\subsection{{\bfseries\sffamily TODO} Decide whether nested roles should live as dotted strings, nested TOML tables, or both}
\label{sec:org39d6122}
\subsection{{\bfseries\sffamily TODO} Prototype a Nix helper that reads \texttt{inventory.toml} and projects it into Snowfall role toggles}
\label{sec:org52e072a}
\end{document}
